<?php
/**
 * Created by PhpStorm.
 * User: qichao
 * Date: 2018/5/18
 * Time: 18:09
 */
// +----------------------------------------------------------------------
// | 错误码
// | 用法  config('codemsg.200');
// +----------------------------------------------------------------------
/*
200	正常
400-499	权限错误
500-599	系统错误
600-699	请求接口数据 验证错误
1000-1799	用户模块
8000-8999   数据库数据问题
*/
return [
    '200'=>'成功',
    '300'=>'缺少必要参数',
    '301'=>'非法请求',
    '302'=>'参数错误',
    '303'=>'尚未登录',

    '403'=>'超级管理员禁止删除',
    '404'=>'获取签名失败',
    '405'=>'invalid token',
    '406'=>'invalid ContentType',

    '601'=>'接口请求方式为GET',
    '602'=>'接口请求方式为POST',
    '603'=>'发送过于频繁',
    '604'=>'验证码错误',
    '605'=>'邮箱格式错误',
    '606'=>'天气代码格式错误',
    '607'=>'上传文件大小不符',

    '1000'=>'用户名不能为空',
    '1001'=>'两次密码不一致!!',
    '1002'=>'密码不能为空',
    '1003'=>'手机号不能为空',
    '1004'=>'手机号格式不正确',
    '1005'=>'手机号已存在',
    '1006'=>'验证码不能为空',
    '1007'=>'验证码错误',
    '1008'=>'用户不存在或被封禁',
    '1009'=>'操作失败',
    '1010'=>'密码错误',
    '1011'=>'密码限制6-8位，大小写字母数字组合',
    '1012'=>'用户名必须为手机号',
    '1013'=>'用户已存在',
    '1014'=>'用户已存在,你可以直接登录',
    '1015'=>'请上传头像',

    '8000'=>'数据不存在',
    '8001'=>'你不是业主,无权执行此操作',
    '8002'=>'数据已存在',
    '8003'=>'数据获取失败',
    '8004'=>'每个房屋只能有一个管理员',
    '8005'=>'你已绑定此房屋,无需重复操作!!',
    '8006'=>'你已是此房屋的管理员,不能绑定为成员',
];